# 14. 그룹화
동일한 값을 가진 것들끼리 합쳐서 통계 또는 평균 등의 값을 계산하기 위해 사용

In [1]:
import pandas as pd
df = pd.read_excel("score.xlsx", index_col = "지원번호")
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197   90   85  100  95  85      Python
2번    정대만  북산고  184   40   35   50  55  25        Java
3번    송태섭  북산고  168   80   75   70  80  75  Javascript
4번    서태웅  북산고  187   40   60   70  75  80         NaN
5번    강백호  북산고  188   15   20   10  35  10         NaN
6번    변덕규  능남고  202   80  100   95  85  80           C
7번    황태산  능남고  188   55   65   46  40  35      Python
8번    윤대협  능남고  190  100   85   90  95  95          C#

In [2]:
df.groupby("학교")

In [3]:
df.groupby("학교").get_group("북산고")
#북산고만 가지고 와라.

       이름   학교    키  국어  영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197  90  85  100  95  85      Python
2번    정대만  북산고  184  40  35   50  55  25        Java
3번    송태섭  북산고  168  80  75   70  80  75  Javascript
4번    서태웅  북산고  187  40  60   70  75  80         NaN
5번    강백호  북산고  188  15  20   10  35  10         NaN

In [4]:
df.groupby("학교").get_group("능남고")

       이름   학교    키   국어   영어  수학  과학  사회    SW특기
지원번호
6번    변덕규  능남고  202   80  100  95  85  80       C
7번    황태산  능남고  188   55   65  46  40  35  Python
8번    윤대협  능남고  190  100   85  90  95  95      C#

In [6]:
df.groupby("학교").mean(numeric_only =True)
#계산가능한 데이터들의 평균

              키         국어         영어    수학         과학    사회
학교
능남고  193.333333  78.333333  83.333333  77.0  73.333333  70.0
북산고  184.800000  53.000000  55.000000  60.0  68.000000  55.0

In [7]:
df.groupby("학교").size()

학교
능남고    3
북산고    5
dtype: int64

In [8]:
df.groupby("학교").size()["능남고"]
#학교로 그룹화를 한 뒤에 능남고에 해당하는 데이터의 수

np.int64(3)

In [10]:
df.groupby("학교")["키"].mean(numeric_only =True)
#학교라는 그룹화를 한 후에 키에 대한 평균값을 구한다.

학교
능남고    193.333333
북산고    184.800000
Name: 키, dtype: float64

In [11]:
df.groupby("학교")[["국어","영어","수학"]].mean(numeric_only =True)

            국어         영어    수학
학교
능남고  78.333333  83.333333  77.0
북산고  53.000000  55.000000  60.0

In [12]:
df["학년"] = [3,3,2,1,1,3,2,2]
#학년 column 추가
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기  학년
지원번호
1번    채치수  북산고  197   90   85  100  95  85      Python   3
2번    정대만  북산고  184   40   35   50  55  25        Java   3
3번    송태섭  북산고  168   80   75   70  80  75  Javascript   2
4번    서태웅  북산고  187   40   60   70  75  80         NaN   1
5번    강백호  북산고  188   15   20   10  35  10         NaN   1
6번    변덕규  능남고  202   80  100   95  85  80           C   3
7번    황태산  능남고  188   55   65   46  40  35      Python   2
8번    윤대협  능남고  190  100   85   90  95  95          C#   2

In [16]:
df.groupby(["학교","학년"]).mean(numeric_only =True)
#학교별, 학년별 평균 데이터

            키    국어     영어    수학    과학    사회
학교  학년
능남고 2   189.0  77.5   75.0  68.0  67.5  65.0
    3   202.0  80.0  100.0  95.0  85.0  80.0
북산고 1   187.5  27.5   40.0  40.0  55.0  45.0
    2   168.0  80.0   75.0  70.0  80.0  75.0
    3   190.5  65.0   60.0  75.0  75.0  55.0

In [19]:
df.groupby("학년").mean(numeric_only =True)
#학년 별로 나눌 때 데이터

             키         국어         영어         수학         과학         사회
학년
1   187.500000  27.500000  40.000000  40.000000  55.000000  45.000000
2   182.000000  78.333333  75.000000  68.666667  71.666667  68.333333
3   194.333333  70.000000  73.333333  81.666667  78.333333  63.333333

In [22]:
df.groupby("학년").mean(numeric_only =True).sort_values("키")
#학년 별로 나누고 평균값을 키 값으로 오름차순

             키         국어         영어         수학         과학         사회
학년
2   182.000000  78.333333  75.000000  68.666667  71.666667  68.333333
1   187.500000  27.500000  40.000000  40.000000  55.000000  45.000000
3   194.333333  70.000000  73.333333  81.666667  78.333333  63.333333

In [24]:
df.groupby(["학교","학년"]).sum(numeric_only =True)
#numeric_only =True를 안하면 이름도 붙게 된다.

          키   국어   영어   수학   과학   사회
학교  학년
능남고 2   378  155  150  136  135  130
    3   202   80  100   95   85   80
북산고 1   375   55   80   80  110   90
    2   168   80   75   70   80   75
    3   381  130  120  150  150  110

In [28]:
df.groupby("학교")[["이름","SW특기"]].count()
#학교 별로 나눈 뒤, 이름을 가진 & SW특기를 가진 사람을 카운트한다.

     이름  SW특기
학교
능남고   3     3
북산고   5     3

In [30]:
school =df.groupby("학교")
school["학년"].value_counts()
#학교로 그룹화 한 것을 스쿨에 넣고 스쿨에서 각 학년의 개수를 센다.

학교   학년
능남고  2     2
     3     1
북산고  1     2
     3     2
     2     1
Name: count, dtype: int64

In [31]:
school["학년"].value_counts().loc["북산고"]
# 그 중 북산고의 학년별 학생 수를 알고 싶다.

학년
1    2
3    2
2    1
Name: count, dtype: int64

In [33]:
school["학년"].value_counts(normalize=True).loc["북산고"]
#학생 수 데이터를 퍼센트로 비교하여 가져온다.

학년
1    0.4
3    0.4
2    0.2
Name: proportion, dtype: float64